# Отчет по лабораторной работе N 12 по курсу
# "Фундаментальная информатика"

Студент группы: M80-104Б, Борисов Сергей Павлович\
Контакты: 9802432172sergei@gmail.com\
Работа выполнена: 19.11.2021\
Преподаватель: Безлуцкая Елизавета Николаевна

## 1. Тема

Техника работы с целыми числами. Системы счисления.

## 2. Цель работы

Составить программу на языке Си в целом типе данных, которая для люьых допустимых и корректно записанных чисел, выполняет указанное вариантом действие.

## 3. Задание

Вариант 17.\
Поменять местами первую и последнюю цифры.

## 4. Оборудование

Процессор: AMD Ryzen 5 3500U @ 2.1 GHz\
ОП: 8192 Мб\
НМД: 256 Гб\
Монитор: 1920x1080

## 5. Программное обеспечение

Операционная система семейства: **linux (ubuntu)**, версия **20.04 focal**\
Интерпретатор команд: **bash**, версия **5.0.17**.\
Система программирования: **--**, версия **--**\
Редактор текстов: **emacs**, версия **25.2.2**\
Утилиты операционной системы: **--**\
Прикладные системы и программы: **--**\
Местонахождение и имена файлов программ и данных на домашнем компьютере: **F:\Ubuntu 20.04**

## 6. Идея, метод, алгоритм решения задачи

На ввод подается число, ищем и запоминаем последнюю цифру в числе. Точно такую же процедуру проводим и с перво-стоящейцифрой числа. Меняем местами, используя заранее введенные переменные. Выводим получившееся число.

## 7. Сценарий выполнения работы

```
№ | Ввод   | Вывод    |
--+--------+----------+
1 | 13543  | 33541    |
--+--------+----------+
2 | -0     | 0        |
--+--------+----------+
3 | +0     | 0        |
--+--------+----------+
4 | 5316254| 4316255  |
--+--------+----------+
5 | 1234567|  7234561 |
--+--------+----------+
```

## 8. Распечатка протокола

```
#include <stdio.h>

int main(void)
{
    long long num, one, unone, a, n = 1;
    while (scanf("%lli", &num) != EOF) {
        n = 1;
        if (num == 0) {
            printf("%lli\n", num);
            continue;
        }
        a = num;
        unone = a % 10;
        while (a != 0) {
            a /= 10;
            n *= 10;
        }
        n /= 10;
        one = num / n;
        num %= n;
        num += unone * n;
        num /= 10;
        num *= 10;
        num += one;
        printf("%lli\n", num);
    }
    return 0;
}
```

## 9. Дневник отладки

```
---+---------------+------------+-------+--------------------+---------------------------------------------+---------------+
 № | Лаб. или дом. | Дата       | Время | Событие            | Действие по исправлению                     | Примечание    |
===+===============+============+=======+====================+=============================================+===============+
 0 | Дом           | 16.11.2021 | 11:30 | Не проходит 8 тест | Ошибка возможна в неучете "-" перед числами | Какая пакость |
-------------------+------------+-------+--------------------+---------------------------------------------+---------------+
```

## 10. Замечания автора по существу работы

Замечаний и претензий к данной лабораторной работе не имею.

## 11. Выводы

В данной лабораторной работе продолжается изучение возможностей языка Си и оттачивание навыков программирования. 
